{"body":"Life's going pretty good. Working on an engineering degree so not much time for games anymore. You still play?","subreddit_id":"t5_310v1","subreddit":"007chan"}
{"body":"What up big black?  I redirected here just to have some kind of chat log. Not many people were interested tho. Nice of you to stop by. I don't internet much these days. i will always hold this domain tho unless the owners of jdak.com offer me $10,000. Just don't have anything to put on it really. How is life for you?","subreddit_id":"t5_310v1","subreddit":"007chan"}
{"body":"Try harder","subreddit_id":"t5_2wx28","subreddit":"00s"}
{"body":"Middle school...\n\nFuck, I'm old. ","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":"still my favorite song from middle school. ah adolescence ","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":"http://i.imgur.com/iUezC1o.jpg","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":"sorry man:(","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":"I heard this song at a bowling alley last year! This song is awesome!","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":":3","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":"This song never gets old. I remember hearing this a lot when I was 10.","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":"No worries. Just seems like people born in 2009 are now magically 25 years old now. How is that even possible?","subreddit_id":"t5_2vjtm","subreddit":"00sRock"}
{"body":"Everything was so shiny.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"* 2004-5 - [Nokia 3120](http://www.bennylingbling.com/images/skitch/nokia3120-20100616-134703.jpg) (first phone! looking back, that thing was tiny!)\n\n* 2006 - [Nokia 3220](http://media.engadget.com/img/product/9/7an/nokia-3220-cgs-800.jpg) (thought the side lights were so cool)\n* 2007 - [Sony Ericsson S710](http://www.extragsm.com/images/phone/big/Sony%20Ericsson/S710/Sony-Ericsson-S710-01.jpg)\n* Late 2007 - [Samsung Blackjack](http://www.swotti.com/tmp/swotti/cacheC2FTC3VUZYBIBGFJA2PHY2S=/imgsamsung%20blackjack3.jpg) (really loved this one)\n\n* Sept 2008 - [iPhone 3G](http://media.engadget.com/img/product/2/iphone-3g-2o4-800.jpg) (iphones from then on)\n","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"4 years from the Nokia 3120, to iphone 3G!!!!! Still gets me how crazy that is. I remember when flip phones were *the shitt*. Now they are shit.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"Lucky you! People forget that before iPhone was unveiled, communicators already could do everything and even more.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"Headspace was the shit! I remember it freaked out my little brother, though. ","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"I held onto the raver/y2k look wayy beyond it's popularity: baggy cargo pants, synthetic jackets with the finger hole things, single strap side backpack, spiked up colored hair etc. Then slowly moved to a more generic style; hollister/fake retro brand t-shirts and boardshorts/cargo shorts with surfer hair, those puka necklaces, and like 10 livestrong bracelets at one point.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"&gt; Sony Ericsson that resembled a dildo\n\nCan you be more specific? Google only shows \"Download free Dildo theme for Sony Ericsson 4.5\" which is not my cup of tea.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"[Treo 650](http://upload.wikimedia.org/wikipedia/commons/6/67/Treo650-Sprint.png)\n\nI remember sporting this bad boy in 2006.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"Too lazy to figure out what model it was, but not lazy enough to not lovingly craft this [artist's rendering](http://i.imgur.com/Qyff8Da.png) of it for you.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"np","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"Every 90s-2000s video: group dancing in a high-tech room.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"This is still a thing in windows.  Hit the ALT key and push the underlined letter and it clicks the button.  It's not always the first letter.\n\nIf you're on Windows hit Window+R to bring up the run dialog.  You'll see that \"Browse\" has a underlined B.  Hit ALT+B and it'll bring up the file selection dialog.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"I remember this being in a Hershey chocolate commercial in the early 2000s. Very cool. ","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"OP gets around ","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"I had a roommate who stole all my baggy pants in 2002. I was so mad at the time, but in retrospect, he did me a favor.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"I had a Sony Ericsson that resembled a dildo and hence it was dubbed the \"dildo phone\".","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"matrix-esque","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"Good God that's beautiful.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"[LG Chocolate](http://i.imgur.com/MxAVIIv.jpg)","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"Thanks, I'm speechless. I'm going to hang it on my fridge right now.","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"POOL'S CLOSED","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"I remember there was time you couldn't watch MTV for 2 hours without seeing this video","subreddit_id":"t5_3645h","subreddit":"00sdesign"}
{"body":"What if I'm a Zeros clicker?","subreddit_id":"t5_37n61","subreddit":"01s"}
{"body":"Literally all you have to do is be self sufficient. Fish all your own food and make your own potions and supplies. This is why I made an iron man account. I think it is how runescape should be played! It's a lot of fun! Add New Mission. I just made this account :) I'll help you through it bud.","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"[deleted]","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"yes.","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"what's at 72 slayer?\n","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"i heard somewhere that they will probably do a grand master quest to tie in all the unfinished quest stories. it's definitely going to be epic.","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"i was just about to comment this exact thing.\n","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"Make f2p members, change name, wait 30 days and change again OR buy a bond on rs3 and change its name again.","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"What kind of a question is this? Of course they are down. The question should be \"Servers Up?\" because they are down more than up! These servers have been DCing sense release. All they have ever done is come up with excuses as to why they are going down. It's never there problem. Now it's \"We banned a group of DCers and now they are DCing the servers\" Come on. For real? Always an excuse for everything. They never fuck up it's just odd. Yeah its a small DEV team things are bound to go wrong. But own up to them! Don't feed us bullshit lies as to why things go wrong and actually do nothing to fix them. Especially if a mod reads this. Tell us whats really going on","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"Do you prefer skilling or combat?","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"Absolutely! The devs have been working on some amazing content. An entire new continent, new bosses (Zulrah and Abyssal), the wilderness bosses, rumors of an ice cape (range/mage equivalent of fire cape), new weapons (blowpipe) and a whole crap load of other great things like achievement diaries/other content\n\n if you watch their weekly Q&amp;A you can get the basics. [Here](https://www.youtube.com/watch?v=QCO8wdANMgY&amp;list=PLRs68iqW7gYtgaxXkzBcfCZh9HYREiXMx) \n\nHelp keep the community alive!","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"M'drop","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"r/2007scape","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"sorry! ha! I posted this before I knew of the Ddos attacks friend","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"I'm sorry that happened to you but it's not like 3 defence  is the end of the world. That's 1 combat level at most.","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"skeletal wyverns, it's a good money maker","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"omg i forgot people did this","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"Sosolid2k was the man!! ","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"I think it's worth coming back to, even with low stats. Just means there is more to do! Go for fire cape, quest cape, or at least barrows gloves. Gives you a ton of goals that will keep you playing for months! If you need any help msg me, always willing to help low lvl players.","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"You're fine. It's just the DC's are happening as we speak. Getting on my nerves considering they expect us to play nearly $10 a month and can't even supply us with game servers to withstand kids at home DDoSing off there home internet. Pretty sad. Frustrates me","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"this is pretty awesome and unique lol. cool idea. ","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"[deleted]","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"and hey the official 07 subreddit is /r/2007scape , you should post to that instead.","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"Yeah. If you enjoy losing connection on a daily basis and willing to take the risk of losing your entire bank to do something other than bank stand. Sure. With all that said i still play. Actually the only reason i'm here and typing this is because all of the worlds are currently offline. ","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"That really blows man. May as well become zerker now lol ","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"i agree with this.\n","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"get 72 slayer","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"combat :)","subreddit_id":"t5_2wfrv","subreddit":"07Scape"}
{"body":"beautiful larged breasted fat indian ladies","subreddit_id":"t5_35607","subreddit":"0XhiVXJV1CXbP5lwA0Qc"}
{"body":"Thanks, good to know","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"Sweet! Thanks for the info! Another thing I would like to know is unit counters, like what counters what, and you seem like you would know these. Is it a basic \"infantry beats cavalry, cavalry beat archers, archers beat infantry\" triad like Age of Empires or something different? I would like to change my army composition if the AI starts getting certain units out.","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"This is my current strategy. Some of the most important parts are to have constant unit production, to build houses in advance so that you don't stop your constant unit production, and to collect resources in such a way that you don't have too much of one resource, if you have a lot of one resource then it means that the time could have been spent collecting a different resource that you need more.\n\n* Send villagers to berry bushes, create as many villagers as you can\n\n* Send horse unit to chickens or nearby animals\n\n* Build house with 4 military units and then build storage building by wood and have them collect wood\n\n* Send villagers to berry bushes until you have 10 there, then start sending them to wood\n\n* When you think you can comfortably spend wood, build infantry skirmishers. These units seem to be quite a bit stronger than archers and slingers, and they can hit and run melee units.\n\n* When berry bushes run out, build farms around town centre. When food looks like it might start running low start sending villagers to build farms. Build a mill (I forget what it's called) and build farms around it, only build as many farms as you need since units can be collecting other resources.\n\n* When you have 800 food and 800 wood (I think), upgrade to the next age. At this point I usually take a number of citizen soldiers and have them build a storage building between the stone and metal supplies and get them to start collecting those.\n\n* Eventually, build a second town centre somewhere, and build two markets as far apart as you can while they are still safe, and set up trade between them. I usually built a market as soon as I hit the age when they are unlocked, don't be afraid to trade resources if you have too much of one (usually food) and need something else.\n\n* Keep building units and collecting resources until you can build champion units, then mass those and attack everyone, a few rams/elephants help\n\nBefore realizing how strong champion units are, I used to use cavalry skirmishers as the base of my army. They seem to be very strong and can hit and run melee units, you can make an army of like 30 cavalry skirmishers and they should be able to handle most attacks. You can also build them from early ages, so instead of advancing you can build a bunch of them early on and then just have them protect you.\n\nAnother tip is with garrisoning, military units add arrows to the town centre, villagers don't, so garrison more military units than villagers and it will help defeat invading armies. I usually garrison 10-15 military units and then ring the town bell if I am getting overwhelmed. Sometimes I find myself having an enemy army follow my units in circles around my town centre while my town centre kills them with arrows.\n\nI mentioned it before, but there seems to be a pretty big difference between an army of skirmishers and an army of archers or slingers, I think there's a bit of a balancing issue there but oh well.\n\nAlso, being offensive is important. I used to build sword-cavalry armies to surprise and destroy an opponent's town centre, after that the AI is sort of crippled and their buildings lose health and fall apart on their own. If you're having trouble against an AI, I would recommend building 20 sword-cavalry on the side and sending them directly to the main enemy town centre, you might have to send multiple waves and you might have to retreat if they have a lot of spear/pike infantry units.\n\nAnother thing: I've been playing 4-player free-for-all on the hardest difficulty, although a similar strategy should work for 1-on-1. Sometimes in 4-player ffa, all three AI opponents send their armies to your base, I don't know why, maybe it's just luck. When they do that, sometimes I take the army I am defending with (not my whole army, just enough to have their army follow it) and get them to slowly retreat away from my town, so that rather than attacking my town, the enemy army follows my army. Then I send them into another opponent's town, then my units die and the other two opponents start fighting each other. So far when I've done this the enemies stop attacking me, I suspect it ignites some sort of conflict and they keep attacking each other instead of me. I only do this when I'm overwhelmed, but you might be able to divert a lot of armies this way.","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"I was trying to set up good counters, but I have found it easier to just use a lot of skirmishers (infantry or cavalry) with micromanagement, and then champion units (assisted by rams/elephants) when they are available, whichever ones the civilization has access to, usually melee infantry or chariot archers. Upgrading the units with the blacksmith helps too.\n\n[This site](http://0ad.wikia.com/wiki/Infantry_Swordsman) has information on what units are good against what other units, but I think it's more of a general guideline. In the unit description in the game it shows that spearmen have 2x bonus against cavalry and pikemen have 3x bonus (I think), but I'm not sure if there are any other actual bonuses. In the wiki site it says that spear cavalry are supposed to have a bonus against infantry swordsmen, but I'm not sure if they actually do.\n\nThere are situations where archers have countered my skirmishers, if my skirmishers are busy with melee units, and behind those melee units are archers with longer range, then that will beat my skirmishers, but if you send skirmishers around the melee units and have them attack the archers directly while evading the melee units then again I think the skirmishers win. That has just been my experience though, I could be missing something.\n\nEdit: Also, spearmen/pikemen have a lot of armour and a good amount of health, so I guess you're supposed to have them to complement whatever archers you are using, so that they absorb damage.","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"Unfortunately those wikia unit stats are outdated. Recent Alpha releases have made considerable changes to all unit stats.","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"I remember reading somewhere that the lighthouse will allow you to see every coastline on the map","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"I think in the description it says that it's currently useless because the game isn't finished yet, I might be getting mixed up with the Mauryans though, they have an obelisk thing, I don't remember the Egyptians having one. The Mauryans have a hero unit that does something with the obelisks, Ashoka or something like that, but in the description it says that they aren't finished yet, since the game is still in development, so they are currently useless.\n\nI think the Egyptians have a lighthouse that has a huge line of sight, I don't recall Egyptian obelisks, so I could be wrong.\n\nEdit: I just found [this](https://github.com/0ad/0ad/blob/master/binaries/data/mods/public/simulation/templates/other/obelisk.xml), so maybe I have just been getting mixed up with the Mauryan tower things, so nevermind I guess.","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"The obelisk that appears on some maps is currently just an eyecandy object. In future they might be given some functionality.","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"#####&amp;#009;\n\n######&amp;#009;\n\n####&amp;#009;\n [**Infantry Swordsman**](https://0ad.wikia.com/wiki/Infantry%20Swordsman) (from 0Ad wikia): [](#sfw) \n\n---\n&gt;\n&gt;Infantry Swordsmen are melee infantry that deal only hack damage, who excel at countering spearman and hacking away at buildings. Only a few civilizations possess Swordsmen citizen soldiers, although they're usually available as Champion units. Their main purpose is counter other infantry, especially melee spearman but are very vulnerable to all Cavalry especially Cavalry Spearman and Archers. They also receive bonuses against Elephants, promoted Infantry Swordsmen receive upgrades to their attack, hitpoints and all their armor.\n&gt;Infantry Swordsmen are produced at both the Civilization Center and Barracks for the civilizations that have access to them, others can typically find their champion versions.\n&gt;[**Image**](https://i.imgur.com/3DMdCJV.png) [^(i)](http://vignette4.wikia.nocookie.net/0ad/images/6/69/Caetrati.png)\n&gt;^Interesting: [^Infantry](https://0ad.wikia.com/wiki/Infantry) ^| [^Cavalry ^Swordsman](https://0ad.wikia.com/wiki/Cavalry Swordsman) ^| [^Infantry ^Skirmisher](https://0ad.wikia.com/wiki/Infantry Skirmisher) ^| [^Infantry ^Archer](https://0ad.wikia.com/wiki/Infantry Archer) \n\n^Parent ^commenter ^can [^toggle ^NSFW](http://www.reddit.com/message/compose?to=autowikiabot&amp;subject=AutoWikibot NSFW toggle&amp;message=%2Btoggle-nsfw+cr1hvvp) ^or[](#or) [^delete](http://www.reddit.com/message/compose?to=autowikiabot&amp;subject=AutoWikibot Deletion&amp;message=%2Bdelete+cr1hvvp)^. ^Will ^also ^delete ^on ^comment ^score ^of ^-1 ^or ^less. ^| [^(FAQs)](http://www.reddit.com/r/autowikiabot/wiki/index) ^|  [^Source](https://github.com/Timidger/autowikiabot-py)\n ^(Please note this bot is in testing. Any help would be greatly appreciated, even if it is just a bug report! Please checkout the) [^source ^code](https://github.com/Timidger/autowikiabot-py) ^(to submit bugs)","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"It helps that the first versions of their engine started development in 2006. The original system requirements were a nvidia geforce card with 64mb of ram!","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"Most of the features needed for a multiplayer game are in, and the latest alpha 18 has improved performance where it used to get really laggy in large battles","subreddit_id":"t5_2sbet","subreddit":"0ad"}
{"body":"&gt;A 14 trillion kilometres long journey. That's the distance light has been travelling since the first version of 0RBITALIS was released in December 2013. I'm very pleased to announce that the game is finally exiting Early Access. And it includes some very juicy new features... \n\n&gt;100 levels, across twelve sectors. Early Access brings three new Sectors, each one with a unique gameplay mechanics. \n\n&gt;Teleportation. Yes, 0RBITALIS now features teleportation. \n\n&gt;Bullet time. One of the most requested feature. With the right click you can now slow down the time and aiming for that perfect shot. \n\n&gt;Enemies. Let's be honest: finding new life forms was always going to happen. The universe of 0RBITALIS is now full of other technologically advanced species, capable of launching their own satellites. Some of them, even more advanced then yours... \n\n&gt;PC and Mac. YES! The game is finally available for Mac users as well!\n\n&gt;For the real fan of the game, a new version is available: the Supernova Edition. It features A LOT of new content, including dozens of backgrounds, the original soundtrack from Doseone and an art book called ORBIT ART. Games are art, and we all know it. Now is the time to accept the fact that Gravity is, without any doubt, the biggest artist in the entire Universe. \n\n&gt;I want to thank you all the people who have supported 0RBITALIS during this journey. \nOrbit long and prosper.","subreddit_id":"t5_31jqn","subreddit":"0rbitalis"}
{"body":"^^^^^yes","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Message me if you need someone with web development powers and/or system administration. I'd be glad to pitch in.\n\nOn a side note. The station screenshots made me think of Space Station 13. Hype levels are over the roof over here of course.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Own engine but use existing libraries where they fit well to speed up process. It's C++(11), squirrel-lang for scripting.\n\nMultiplayer is already working and uses http://www.replicanet.com for the object replication. DCPU screens are sent via delta changes to the pixel array. The rest of the DCPU's state does not sync to the client. \n\nAny other questions please let me know!\n","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"**I WANT IT TO BE KNOWN THAT I LOVE YOU MORE THAN /U/IAMSOTHECOOLEST**","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"I'm using IRC to dump my dev progress.. I really need to find someone capable of mocking up a website! Have the domain and servers but no site is lame.\n\nI'll message as soon as I get something setup!","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"I'm going to update the twitter more often if you are interested - \nhttps://twitter.com/techcompliant","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"I'm not so sure they'd appreciate a post that amounts to \"change your engine...\"","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Message me. I'd be glad to help with a site design. This seems like a cool project to be involved in.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"I'd love to test on Arch/Debian for you!","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"This looks really promising! Is the goal to give the DCPU control over a spaceship, and be able to fly around and participate in game elements, like trading and fighting?","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Sweet, thanks!","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Very nice, are you using SDL 2 for your low level system interaction, and OpenGL / DirectX control, or something else?\n\nP.S. I pm'ed you about the alpha if you are still willing to let people play it.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"When the project was forming in the days after Notched stopped 0x10c there were a lot of voices clamouring for making a custom engine from scratch for \"optimization\" and \"performance.\" (I should note that most of these people sure didn't stick around once actual work needed to be done.) As you know this can easily tack on a year's worth of coding. Even more when people try and make it a generalized engine.\n\nThat being said Unity does not have a linux SDK and a lot of the devs do code in linux.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"This looks awesome! What platforms have you built for so far?","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Not sure about done it but I think we are on our way!","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Modbus is really nice and easy to implement , well atleast the main FCs. Good worl btw","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Thanks!\n\nYes very much,\nA current example is a single engine that applies a impulse force is created in scripting. A data port is added that can be connected to a DCPU so that the DCPU may issue commands/queries to the engine script. \n\nI feel this gives the best control to allow players to create their own devices without each being \"attached hardware\". ","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"I've been following Trillek, but I don't really understand their approach, nor do I hold out much hope that they can make a game. Why a project like that didn't just use Unity, I won't understand. *SO* many indie games die when the honeymoon \nperiod of \"I'll make my own engine!\" wears off.\n\nI have my hands full with two projects, and can't add a third, as cool as 0x10c in SE would be. I hope there are enough of us still around in this sub for someone to look into doing it, though. It only takes one.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Coding in linux is a lot easier than windows, at least for me.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Do you have a Dev blog somewhere? I'd love to keep an eye on this.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"How much familiarity with the DCPU spec are you looking for in testers? I'm quite adept with assembly in general, but I haven't looked into the DCPU since the early days of 0x10c. I'd be happy to test it and give you feedback.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Back at ya! &lt;3","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"I can test Arch as well.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"The data ports are agnostic to any underlying data - Modbus, CAN-bus would be very suitable! \n\nI'm trying to push as much control to the players as possible so not much is implemented in-engine but the very basics.\n\nNew hardware can be specced and implemented in scripting by the community - Only needing to run a dedicated server/single-player to test. \n\nDCPU programs can be written,edited,assembled in game directly.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"I thought the exact same thing when I read the announcement.  Maybe a post over on /r/trillek...?","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
{"body":"Holy shit you've done it. I knew someone would come through.","subreddit_id":"t5_2tu92","subreddit":"0x10c"}
